# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 그리고 '토', '일' 을 순서대로 추가해주세요.
list1 = ['월', '화', '수', '목', '금']
list1.append('토')
list1.append('일')

print(list1)

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 그리고 '토', '일' 을 담은 리스트를 만들고 2개의 리스트 합쳐서 새로운 리스트를 만들어주세요.\
list2_1 = ['월', '화', '수', '목', '금']
list2_2 = ['토', '일']
list2 = list2_1 + list2_2

print(list2)

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 그리고 '+=' 연산자를 이용해서 '토', '일' 을 한번에 추가해주세요.
list3 = ['월', '화', '수', '목', '금']
list3 += ['토', '일']

print(list3)

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 그리고 가장 처음 요소를 출력해주세요.
list4 = ['월', '화', '수', '목', '금']

print(list4[0])

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 그리고 가장 마지막 요소를 출력해주세요.
list5 = ['월', '화', '수', '목', '금']

print(list5[-1])

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 그리고 가장 마지막에서 2번째 요소를 출력해주세요.
list6 = ['월', '화', '수', '목', '금']

print(list6[-2])

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 그리고 while문을 이용해서 요소 전부 출력해주세요.
list7 = ['월', '화', '수', '목', '금']
i = 0
while i != len(list7):
    print(list7[i])
    i += 1

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 그리고 while문을 이용해서 요소 전부를 역순으로 출력해주세요.
list8 = ['월', '화', '수', '목', '금']
i = len(list7)
while i != 0:
    i -= 1
    print(list8[i])
