# 문제 : 리스트에 순서대로 2, 1, '오', 6, 7를 한번에 담아주세요. 그리고 리스트 안에 있는 '오'를 정수 5로 변경해주세요.
list1 = [2, 1, '오', 6, 7]
for i in range(len(list1)):
    if list1[i] == '오':
        list1[i] = 5
print(list1)

# 문제 : 리스트에 순서대로 2, 1, '오', 6, 7를 한번에 담아주세요. 그리고 리스트 안에 있는 '오'를 제거해주세요.
list2 = [2, 1, '오', 6, 7]
del list2[list2.index('오')]
print(list2)

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. '화'가 리스트 안에 들어있는지 알려주세요.
list3 = ['월', '화', '수', '목', '금']
if '화' in list3:
    print('\'화\'는 리스트에 들어있다.')

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. '화'가 리스트 안에서 몇 번째 데이터 인지 알려주세요.
list4 = ['월', '화', '수', '목', '금']
print(list4.index('화'))

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. '화'가 리스트 안에 있는지 if문으로 체크 후, 있다면 삭제해주세요.
list5 = ['월', '화', '수', '목', '금']
if '화' in list5:
    del list5[list5.index('화')]
print(list5)

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. '토'가 리스트 안에 있는지 if문으로 체크 후, 있다면 삭제해주세요.
list6 = ['월', '화', '수', '목', '금']
if '토' in list6:
    del list6[list6.index('토')]
print(list6)

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 리스트에 있는 '금'을 삭제하는 3가지 방법을 보여주세요.
list7 = ['월', '화', '수', '목', '금']
# 첫 번째 방법 : del list7[list7.index('금')]
# 두 번째 방법 : list7.remove('금')
# 세 번째 방법 : del list7[4]

# 문제 : 리스트에 순서대로 '월', '화', '수', '목', '금'을 한번에 담아주세요. 리스트에 있는 '금'을 안전하게 삭제하는 2가지 방법을 보여주세요.
list8 = ['월', '화', '수', '목', '금']
# 첫 번째 방법 : if '금' in list8: del list8[list8.index('금')]
# 두 번째 방법 : if '금' in list8: list8.remove('금')

# 문제 - 1부터 10까지 리스트로 묶어주세요
OTT1 = [i for i in range(1,11)]
print(OTT1)

OTT2 = []
for i in range(1,11):
    OTT2.append(i)
print(OTT2)

OTT3 = []
i = 1
while True:
    OTT3.append(i)
    i += 1
    if i > 10:
        break
print(OTT3)

# =====================================================

a = ['a1','a2','a3','a4']

print(len(a)) # 4
print(4) # 4
print(a.index('a1')) # 0
print(a.index('a2')) # 1
try:
    print(a.index('a5'))
except:
    print('그런거없다')