# 알고리즘의 복잡도(Complexity of Algorithms)

"""
공간 복잡도(Space Complexity) : 문제를 해결하는데 사용되는 메모리 공간에 대한 복잡도
시간 복잡도(Time Complexity) : 문제를 해결하는데 걸리는 시간에 대한 복잡도
    평균 시간 복잡도(Average Time Complexity) : 문제를 해결하는데 소요되는 시간의 평균
    최악 시간 복잡도(Worst-case Time Complexity) : 문제를 해결하는데 가장 긴 시간
"""

"""
시간 복잡도 표기법
    Big-O Notation : 어떤 함수의 증가 양상을 다른 함수와의 비교로 표현하는 방법
종류
O(n) : 선형 시간 알고리즘
    n의 갯수에 비례한다.
O(log_n) : 로그 시간 알고리즘
    문제 해결에 필요한 과정들이 연산마다 줄어드는 알고리즘
O(n^2): 이차 시간 알고리즘
    문제를 해결에 필요한 단계가 입력 값 n의 제곱과 같다.
    예시 : 삽입 정렬
O(2^n) : 문제의 해결에 필요한 단계의 수가 2의 n 제곱 수와 같다.
O(nlog_n) : 병합 정렬 알고리즘
    1. 정렬된 데이터를 반씩 나누어 각각 정렬시킨다. O(log_n)
    2. 정렬된 각 데이터를 두개씩 한데 합친 후, 정렬한다. O(n)
"""