# 곱하기 혹은 더하기
"""
각 자리가 숫자(0~9)로만 이루어진 문자열 S가 주어졌을 때
왼쪽부터 오른쪽으로 하나씩 모든 숫자를 확인하며 숫자 사이에 '*' 혹은 '+' 연산자를 넣어
결과적으로 만들 수 있는 가장 큰 수를 구하는 프로그램을 작성하라
모든 연산은 왼쪽부터 순서대로(일반적인 사칙연산과 다르게) 이루어짐
"""
"""
문제 해결 아이디어
    대부분의 경우 + 보다 *가 더 큰 값을 만듬
    다만 두 수 중 하나라도 0이나 1일 경우 곱하기보다 더하기가 효율적
    따라서 두 수에 대하여 연산을 수행할 때 두 수 중, 하나라도 1 이상인 경우에는 더하며
    두 수가 모두 2 이상인 경우에는 곱하면 정답이다
"""


# 0과 1을 제외한 수는 + 보다 * 가 더 값을 크게 만듬

data = input()

# 첫 번째 문자를 숫자로 변경하여 대입
result = int(data[0])

for i in range(1,len(data)):
    # 두 수 중에서 하나라도 0 혹은 1 인 경우 곱하기보다는 더하기 수행
    num = int(data[i])
    if num <= 1 or result <= 1:
        result += num
    else:
        result *= num
    
print(result)