# 개미 전사
"""
개미 전사는 부족한 식량을 충당하고자 메뚜기 마을의 식량창고를 몰래 공격하려고 함
식량창고는 여러 개이며 일직선으로 이어져 있음
각 식량창고에는 정해진 수의 식량을 저장하고 있으며 개미전사는 식량창고를
선택적으로 약탈하여 빼앗을 예정
이때 메뚜기 정찰병들은 일직선상에 존재하는 식량창고 중, 서로 인접한 식량창고가 공격받으면 바로 알아챌 수 있음
따라서 개미전사가 정찰병에게 들키지 않고 식량창고를 약탈하기 위해서는 최소 한 칸 이상 떨어진 식량창고를 약탈해야 함
개미 전사를 위해 식량창고 N개에 대한 정보가 주어졌을 때 얻을 수 있는 식량의 최댓값을 구하는 프로그램을 작성하시오
"""

# 정수 N을 입력 받음
n = int(input())

# 모든 식량 정보 입력 받기
array = list(map(int,input().split()))

# 앞서 계산된 결과를 저장하기 위한 DP테이블 초기화
d = [0] * 100

# 다이나믹 프로그래밍 진행(바텀업)
d[0] = array[0]
d[1] = max(array[0],array[1])
for i in range(2,n):
    d[i] = max(d[i-1],d[i-2]) + array[i]

# 계산된 결과 출력
print(d[n - 1])